# COMBINING AND EXPORTING DATA

# CONTENTS

## 1.DATA IMPORTING

## 2.THEORETICAL RUBRIC

## 3.MERGING INSTACART DATA / PRACTICAL PART

## 1.DATA IMPORTING

## IMPORTING LIBRARIES

In [64]:
# Import libraries 
import pandas as pd
import numpy as np
import os

### PATH

In [65]:
path = r'C:\Users\gryzu\12.03.2023 Instacart Basket Analysis'

In [66]:
path

'C:\\Users\\gryzu\\12.03.2023 Instacart Basket Analysis'

### DATASETS IMPORT

In [67]:
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'))

## 2.THEORETICAL RUBRIC

### CONCATENATING DATA

In [68]:
# Define a dictionary containing January 2020 data
data1 = {'customer_id':['6732','767','890','635'], 
         'month': ['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'], 
         'purchased_meat':[0, 13, 3, 4],
    'purchased_alcohol':[1, 2, 10, 0],
    'purchased_snacks':[10, 5, 1, 7]}

In [69]:
# Define a dictionary containing February 2020 data

data2 = {'customer_id':['6732', '767', '890', '635'],
         'month':['Feb-20', 'Feb-20', 'Feb-20', 'Feb-20'],
    'purchased_meat':[0, 10, 5, 3],
    'purchased_alcohol':[2, 4, 14, 0],
    'purchased_snacks':[15, 3, 2, 6]}

In [70]:
# #Convert the dictionary into dataframe
df = pd.DataFrame(data1,index=[0,1,2,3])
df_1 = pd.DataFrame(data2,index=[0,1,2,3])

In [71]:
df

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7

In [72]:
df_1

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [73]:
# creating the frames before contacatenating the data
frames = [df, df_1]

In [74]:
frames

[  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
 0        6732  Jan-20               0                  1                10
 1         767  Jan-20              13                  2                 5
 2         890  Jan-20               3                 10                 1
 3         635  Jan-20               4                  0                 7,
   customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
 0        6732  Feb-20               0                  2                15
 1         767  Feb-20              10                  4                 3
 2         890  Feb-20               5                 14                 2
 3         635  Feb-20               3                  0                 6]

In [75]:
# using concat function for concatinating the frames
df_concat = pd.concat(frames)

In [76]:
df_concat

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [77]:
# use of axis argument 
df_concat = pd.concat(frames, axis = 1)

In [78]:
df_concat

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks
0,6732,Jan-20,0,1,10,6732,Feb-20,0,2,15
1,767,Jan-20,13,2,5,767,Feb-20,10,4,3
2,890,Jan-20,3,10,1,890,Feb-20,5,14,2
3,635,Jan-20,4,0,7,635,Feb-20,3,0,6

### MERGING DATA

In [79]:
#creating new dictionary:
data3 = {'customer_id':['6732','767','890','635'], 
                 'month':['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'],
    'days_purchased_on':[0, 10, 4, 1]}

In [80]:
#converting it to a new dataframe
df_2 = pd.DataFrame(data3,index=[0,1,2,3])

In [81]:
df_2

  customer_id   month  days_purchased_on
0        6732  Jan-20                  0
1         767  Jan-20                 10
2         890  Jan-20                  4
3         635  Jan-20                  1

In [82]:
# we have identified a common column between df and df_2 'customer_id' and the next step would be use merge function
df_merged = df.merge(df_2, on = 'customer_id')

In [83]:
df_merged

,customer_id,month_x,purchased_meat,purchased_alcohol,purchased_snacks,month_y,days_purchased_on
0,6732,Jan-20,0,1,10,Jan-20,0
1,767,Jan-20,13,2,5,Jan-20,10
2,890,Jan-20,3,10,1,Jan-20,4
3,635,Jan-20,4,0,7,Jan-20,1

In [84]:
# since we have month_x and month_y, we need to specify the final dataframe with key
df_merged = df.merge(df_2, on = ['customer_id', 'month'])

In [85]:
df_merged

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on
0,6732,Jan-20,0,1,10,0
1,767,Jan-20,13,2,5,10
2,890,Jan-20,3,10,1,4
3,635,Jan-20,4,0,7,1

In [86]:
# checking a full match by using indicator = true

df_merged = df.merge(df_2, on = ['customer_id','month'], indicator = True)

In [87]:
df_merged

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on,_merge
0,6732,Jan-20,0,1,10,0,both
1,767,Jan-20,13,2,5,10,both
2,890,Jan-20,3,10,1,4,both
3,635,Jan-20,4,0,7,1,both

In [88]:
df_merged['_merge'].value_counts()

_merge
both          4
left_only     0
right_only    0
Name: count, dtype: int64

In [89]:
# Test merge without overwriting
pd.merge(df,df_2, on = ['customer_id', 'month'], indicator = True)

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on,_merge
0,6732,Jan-20,0,1,10,0,both
1,767,Jan-20,13,2,5,10,both
2,890,Jan-20,3,10,1,4,both
3,635,Jan-20,4,0,7,1,both

## 3.MERGING INSTACART DATA / PRACTICAL PART

### STEP 3

In [1]:
# Import libraries 
import pandas as pd
import numpy as np
import os

In [3]:
path = r'C:\Users\gryzu\12.03.2023 Instacart Basket Analysis'

In [4]:
#Importing orders_products_combined dataframe from the pickle file
path_to_pickle = os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl')

In [8]:
df_ords_prods_combined = pd.read_pickle(path_to_pickle)

In [9]:
df_ords_prods_combined.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,0,2539329,1,1,2,8,NaN,196,1,0,both
1,0,2539329,1,1,2,8,NaN,14084,2,0,both
2,0,2539329,1,1,2,8,NaN,12427,3,0,both
3,0,2539329,1,1,2,8,NaN,26088,4,0,both
4,0,2539329,1,1,2,8,NaN,26405,5,0,both

In [10]:
df_ords_prods_combined = df_ords_prods_combined.drop(['Unnamed: 0'], axis=1)

### STEP 4

In [12]:
df_ords_prods_combined.shape

(32434489, 10)

The shape function has shown that everything is good with this dataset.

In [13]:
#before merging it is necessary to drop "_merge" column to avoid errors
df_ords_prods_combined = df_ords_prods_combined.drop(['_merge'], axis=1)

### STEP 5

In [14]:
# Importing a relevant PRODUCTS dataset 
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'))

In [15]:
# droping unnecessary columns 
df_prods = df_prods.drop(['Unnamed: 0'], axis=1)

In [16]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

Comparing two datasets, we can see one common column "product_id". We can try to combine them by using this common column as indicator.

In [17]:
df_prods_and_ords_merge = df_ords_prods_combined.merge(df_prods, on = ['product_id'], indicator = True)

In [18]:
# showing the result 
df_prods_and_ords_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

## STEP 6

In [19]:
# using the merge flag
df_prods_and_ords_merge['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [20]:
df_prods_and_ords_merge.shape

(32404859, 14)

In total we have 32,404.859 rows and can confirm that the merge has been sucessfully completed. Since we have the same data in both datasets, the 'inner-join' option has been used.

### STEP 7

In [21]:
# Exporting the merged dataframe ords_prods_merge

df_prods_and_ords_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_merge1.pkl'))